/*
#############################################################################################
# Black Squad (01.02.2019) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: CombatGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, dano20zombie
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct CombatGame.CCSSystemConfig.CCSSystemConfigData
// 0x002C
struct FCCSSystemConfigData
{
	float                                              MaxSightRadius;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxBehindSightRadius;                             		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxHearingRadius;                                 		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              VisionCone;                                       		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CoverQueryRadius;                                 		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< unsigned char >                            TargetSelection;                                  		// 0x0014 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned char                                      Movement;                                         		// 0x0024 (0x0001) [0x0000000000000000]              
	unsigned char                                      DetermineCanShoot;                                		// 0x0025 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              TargetAwarenessTickDelayTime;                     		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatAnimNodeSequenceByBoneRotation.AnimByRotation
// 0x0014
struct FAnimByRotation
{
	struct FRotator                                    DesiredRotation;                                  		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AnimName;                                         		// 0x000C (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatBot.EnemyPosition
// 0x001C
struct FEnemyPosition
{
	struct FVector                                     Position;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     Velocity;                                         		// 0x000C (0x000C) [0x0000000000000000]              
	float                                              Time;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CBCharInfo.CustomAIData
// 0x002C
struct FCustomAIData
{
	float                                              Tactics;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              StrafingAbility;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              Accuracy;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              Aggressiveness;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              CombatStyle;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              Jumpiness;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              ReactionTime;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     FavoriteWeapon;                                   		// 0x001C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CBCharInfo.CharacterInfo
// 0x008C
struct FCharacterInfo
{
	struct FString                                     CharID;                                           		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     FamilyID;                                         		// 0x0010 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CharName;                                         		// 0x0020 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0030 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     PreviewImageMarkup;                               		// 0x0040 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Faction;                                          		// 0x0050 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FCustomAIData                               AIData;                                           		// 0x0060 (0x002C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CBCheatManager.DSConnectionDelayInfo
// 0x0008
struct FDSConnectionDelayInfo
{
	int                                                MessageType;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              DelayTime;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatItemTransaction.InventoryItemInfo
// 0x0048
struct FInventoryItemInfo
{
	struct FString                                     ItemName;                                         		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                InventorySlotIndex;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                ReferenceIndex;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                InitRentalTime;                                   		// 0x0018 (0x0004) [0x0000000000100000]              
	float                                              InitTickCount;                                    		// 0x001C (0x0004) [0x0000000000100000]              
	int                                                PassedSec;                                        		// 0x0020 (0x0004) [0x0000000000100000]              
	TArray< unsigned char >                            DecoItems;                                        		// 0x0024 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned char                                      ItemState;                                        		// 0x0034 (0x0001) [0x0000000000000000]              
	unsigned long                                      IsNew : 1;                                        		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      EquipState;                                       		// 0x003C (0x0001) [0x0000000000000000]              
	int                                                StackCount;                                       		// 0x0040 (0x0004) [0x0000000000000000]              
	unsigned long                                      IsRandomBox : 1;                                  		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct CombatGame.CombatItemTransaction.ShopItemInfo
// 0x0038
struct FShopItemInfo
{
	class UCombatDataTableRefShopItem*                 refShopItem;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     CodeName;                                         		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ItemName;                                         		// 0x0018 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                ReferenceIndex;                                   		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                Mainprice;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                PriceType;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	unsigned long                                      IsSelectedRepurchaseItem : 1;                     		// 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct CombatGame.CombatItemTransaction.EquipItemInfo
// 0x000C
struct FEquipItemInfo
{
	int                                                PresetIndex;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                InventorySlotIndex;                               		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                EquipSlotType;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.SeqVar_Data
// 0x0038
struct FSeqVar_Data
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      SeqVarClass;                                      		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                IntData;                                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FloatData;                                        		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     VectorData;                                       		// 0x0018 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     StringData;                                       		// 0x0024 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      BoolData : 1;                                     		// 0x0034 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatTypes.AnimNotifyObjectData
// 0x0018
struct FAnimNotifyObjectData
{
	class UClass*                                      AnimNotifyClass;                                  		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       AnimSeqName;                                      		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UObject*                                     ObjectData;                                       		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatTypes.TimeData
// 0x0008
struct FTimeData
{
	unsigned char                                      UnknownData00[ 0x2 ];                             		// 0x0000 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.TimeData.Year
	unsigned char                                      UnknownData01[ 0x2 ];                             		// 0x0002 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.TimeData.Day
	unsigned char                                      Month;                                            		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned char                                      Hour;                                             		// 0x0005 (0x0001) [0x0000000000000000]              
	unsigned char                                      Min;                                              		// 0x0006 (0x0001) [0x0000000000000000]              
	unsigned char                                      Sec;                                              		// 0x0007 (0x0001) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ComplaintReceiptInfo
// 0x0024
struct FComplaintReceiptInfo
{
	int                                                MyUserID;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     SendImageURL;                                     		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Complainer_ID;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned char                                      COMPLAINT_TYPE;                                   		// 0x0018 (0x0001) [0x0000000000000000]              
	int                                                Complaint_Receipt_Time;                           		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                TickCount;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.TakeDamageData
// 0x0078
struct FTakeDamageData
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                DamageAmount;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	class AController*                                 EventInstigator;                                  		// 0x000C (0x0008) [0x0000000000000000]              
	struct FVector                                     HitLocation;                                      		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FVector                                     Momentum;                                         		// 0x0020 (0x000C) [0x0000000000000000]              
	class UClass*                                      DamageType;                                       		// 0x002C (0x0008) [0x0000000000000000]              
	struct FPointer                                    CombatDamageType;                                 		// 0x0034 (0x0008) [0x0000000000001000]              ( CPF_Native )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x003C (0x002C) [0x0000000000080000]              ( CPF_Component )
	class AActor*                                      DamageCauser;                                     		// 0x0068 (0x0008) [0x0000000000000000]              
	unsigned char                                      HitPart;                                          		// 0x0070 (0x0001) [0x0000000000000000]              
	int                                                HealthWhenTakeDamage;                             		// 0x0074 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.PlayerVoiceChat
// 0x0020
struct FPlayerVoiceChat
{
	int                                                Uid;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                UI_Index;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     PlayerName;                                       		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                VC_Status;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      IsMuted : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct CombatGame.CombatTypes.ExchangeAddMoneyStruct
// 0x000C
struct FExchangeAddMoneyStruct
{
	int                                                MoneyType;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MainMoney;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                BonusMoney;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.BasicCrosshairSetting
// 0x0020
struct FBasicCrosshairSetting
{
	int                                                CrosshairClr;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      DotOnly : 1;                                      		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      BasicCrosshairType;                               		// 0x0008 (0x0001) [0x0000000000000000]              
	unsigned long                                      UseCenterDot : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned char                                      Outline;                                          		// 0x0010 (0x0001) [0x0000000000000000]              
	unsigned char                                      Alpha;                                            		// 0x0011 (0x0001) [0x0000000000000000]              
	float                                              Scale;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned char                                      ShadowType;                                       		// 0x0018 (0x0001) [0x0000000000000000]              
	unsigned char                                      CenterOffset;                                     		// 0x0019 (0x0001) [0x0000000000000000]              
	unsigned char                                      Thickness;                                        		// 0x001A (0x0001) [0x0000000000000000]              
	unsigned long                                      DoSpread : 1;                                     		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct CombatGame.CombatTypes.StatSaveCondition
// 0x0004
struct FStatSaveCondition
{
	unsigned long                                      bLoseStat : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDesertionStat : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bOtherStat : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct CombatGame.CombatTypes.RoundStatusInfo
// 0x0014
struct FRoundStatusInfo
{
	int                                                TeamScore;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                currentWave;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                ObjectHealth;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                ObjectHealthMax;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                RemainingBotCount;                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.InviteInfo
// 0x0006
struct FInviteInfo
{
	int                                                HostId;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x2 ];                             		// 0x0004 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.InviteInfo.Password
};

// ScriptStruct CombatGame.CombatTypes.AwaitList
// 0x003C
struct FAwaitList
{
	int                                                userID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     NickName;                                         		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                Exp;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                CallingCardID;                                    		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     ClanName;                                         		// 0x001C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                EmblemID;                                         		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                ClanExp;                                          		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                TierPoint;                                        		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                CompetitionModeID;                                		// 0x0038 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ScrNoticeInfo
// 0x0014
struct FScrNoticeInfo
{
	struct FString                                     msg;                                              		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                EndTime;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.TableInfoType
// 0x002C
struct FTableInfoType
{
	struct FString                                     CodeName;                                         		// 0x0000 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                Score;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                RankExp;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                CreditPoint;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                ModeDependencyScore;                              		// 0x001C (0x0004) [0x0000000000000000]              
	struct FName                                       KillType;                                         		// 0x0020 (0x0008) [0x0000000000000000]              
	int                                                LocalizedStrID;                                   		// 0x0028 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ClanMatchData
// 0x0028
struct FClanMatchData
{
	int                                                A_MatchWin;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                A_MatchLose;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                B_MatchWin;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                B_MatchLose;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                Rank_MatchWin;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                Rank_MatchLose;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                auto_A_MatchWin;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                auto_A_MatchLose;                                 		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                auto_B_MatchWin;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                auto_B_MatchLose;                                 		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.MatchPlayerData
// 0x0034
struct FMatchPlayerData
{
	struct FString                                     UserName;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                EmblemID;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                userID;                                           		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                Kill;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                Death;                                            		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                Assist;                                           		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                Score;                                            		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                Level;                                            		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                GameLevel;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned long                                      Desert : 1;                                       		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct CombatGame.CombatTypes.ClanMatchRecordData
// 0x00A0
struct FClanMatchRecordData
{
	struct FString                                     EnemyClanName;                                    		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                EnemyEmblemID;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanRank;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanPoint;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanAmatchWinScore;                          		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                EnemyClanAmatchLoseScore;                         		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanBmatchWinScore;                          		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanBmatchLoseScore;                         		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                EnemyClanRankmatchWinScore;                       		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                EnemyClanRankmatchLoseScore;                      		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                MyClanPoint;                                      		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                MyClanRank;                                       		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                MyClanAmatchWinScore;                             		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                MyClanAmatchLoseScore;                            		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                MyClanBmatchWinScore;                             		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                MyClanBmatchLoseScore;                            		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                MyClanRankmatchWinScore;                          		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                MyClanRankmatchLoseScore;                         		// 0x0050 (0x0004) [0x0000000000000000]              
	struct FTimeData                                   MatchTime;                                        		// 0x0054 (0x0008) [0x0000000000000000]              
	int                                                ModeID;                                           		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                MapID;                                            		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                Win;                                              		// 0x0064 (0x0004) [0x0000000000000000]              
	int                                                Lose;                                             		// 0x0068 (0x0004) [0x0000000000000000]              
	int                                                MyTeamIndex;                                      		// 0x006C (0x0004) [0x0000000000000000]              
	int                                                EnemyTeamIndex;                                   		// 0x0070 (0x0004) [0x0000000000000000]              
	int                                                BestScoreUserId;                                  		// 0x0074 (0x0004) [0x0000000000000000]              
	int                                                BestKillUserId;                                   		// 0x0078 (0x0004) [0x0000000000000000]              
	unsigned long                                      Outcome : 1;                                      		// 0x007C (0x0004) [0x0000000000000000] [0x00000001] 
	TArray< struct FMatchPlayerData >                  ClanMatchPlayer;                                  		// 0x0080 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FMatchPlayerData >                  EnemyMatchPlayer;                                 		// 0x0090 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.MatchResultPlayerData
// 0x0098
struct FMatchResultPlayerData
{
	int                                                userID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     NickName;                                         		// 0x0004 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                Level;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned char                                      TeamIndex;                                        		// 0x0018 (0x0001) [0x0000000000000000]              
	int                                                Score;                                            		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                ModeScore;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                PlayedTime;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                Kill;                                             		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                Assist;                                           		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                Death;                                            		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                Life;                                             		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                CRPoint_Acquired;                                 		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                CRPoint_Used;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	unsigned char                                      PlayedMilitaryBranch;                             		// 0x0040 (0x0001) [0x0000000000000000]              
	unsigned char                                      Rank;                                             		// 0x0041 (0x0001) [0x0000000000000000]              
	unsigned char                                      TotalRanking;                                     		// 0x0042 (0x0001) [0x0000000000000000]              
	unsigned char                                      TeamRanking;                                      		// 0x0043 (0x0001) [0x0000000000000000]              
	int                                                Gold;                                             		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                Exp;                                              		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                ClanID;                                           		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                EmblemID;                                         		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                ClanPoint;                                        		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                ClanExp;                                          		// 0x0058 (0x0004) [0x0000000000000000]              
	struct FString                                     ClanName;                                         		// 0x005C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                CCardID;                                          		// 0x006C (0x0004) [0x0000000000000000]              
	TArray< int >                                      BoosterItemList;                                  		// 0x0070 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      RewardItemList;                                   		// 0x0080 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                TierPoint;                                        		// 0x0090 (0x0004) [0x0000000000000000]              
	int                                                CompMatchCount;                                   		// 0x0094 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ObjectDamageModifierStaticLightingInfo
// 0x0038
struct FObjectDamageModifierStaticLightingInfo
{
	TArray< class UShadowMap2D* >                      ShadowMaps;                                       		// 0x0000 (0x0010) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< class UShadowMap1D* >                      ShadowVertexBuffers;                              		// 0x0010 (0x0010) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	struct FLightMapRef                                LightMap;                                         		// 0x0020 (0x0008) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	TArray< struct FGuid >                             IrrelevantLights;                                 		// 0x0028 (0x0010) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.ClanJoinList
// 0x0004
struct FClanJoinList
{
	int                                                ClanID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ClanJoinMemberList
// 0x0020
struct FClanJoinMemberList
{
	int                                                userID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     NickName;                                         		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      Level;                                            		// 0x0014 (0x0001) [0x0000000000000000]              
	struct FTimeData                                   RegistrationTime;                                 		// 0x0018 (0x0008) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ClanListMatchData
// 0x0028
struct FClanListMatchData
{
	int                                                ModeID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MapID;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     OtherClanName;                                    		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      WinCount;                                         		// 0x0018 (0x0001) [0x0000000000000000]              
	unsigned char                                      OtherWinCount;                                    		// 0x0019 (0x0001) [0x0000000000000000]              
	unsigned long                                      Outcome : 1;                                      		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	struct FTimeData                                   MatchTime;                                        		// 0x0020 (0x0008) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.ClanListDetailData
// 0x0040
struct FClanListDetailData
{
	struct FString                                     Introduce;                                        		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                A_Match_Win;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                A_Match_Lose;                                     		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                B_Match_Win;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                B_Match_Lose;                                     		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                Rank_Match_Win;                                   		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                Rank_Match_Lose;                                  		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                Region_ID;                                        		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                RankPoint;                                        		// 0x002C (0x0004) [0x0000000000000000]              
	TArray< struct FClanListMatchData >                MatchRecord;                                      		// 0x0030 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.ClanList
// 0x005C
struct FClanList
{
	int                                                ClanID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     ClanName;                                         		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMasterName;                                   		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Region;                                           		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                MemberCurrentCount;                               		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                MemberMaxCount;                                   		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x2 ];                             		// 0x0030 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.ClanList.ClanMasterLevel
	unsigned char                                      UnknownData01[ 0x2 ];                             		// 0x0032 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.ClanList.EmblemID
	struct FTimeData                                   RegistrationTime;                                 		// 0x0034 (0x0008) [0x0000000000000000]              
	int                                                A_Match_Win;                                      		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                A_Match_Lose;                                     		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                B_Match_Win;                                      		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                B_Match_Lose;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                Total_Match_Win;                                  		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                Total_Match_Lose;                                 		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                ClanExp;                                          		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                ClanRankPoint;                                    		// 0x0058 (0x0004) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.MessengerInfo
// 0x0078
struct FMessengerInfo
{
	int                                                userID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      SessionState;                                     		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned long                                      bAFK : 1;                                         		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     NickName;                                         		// 0x000C (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned char                                      Level;                                            		// 0x001C (0x0001) [0x0000000000000000]              
	struct FTimeData                                   LogoutTime;                                       		// 0x0020 (0x0008) [0x0000000000000000]              
	int                                                LogoutDurationHour;                               		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                RefChannelID;                                     		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned char                                      ChannelNumber;                                    		// 0x0030 (0x0001) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x2 ];                             		// 0x0032 (0x0002) UNKNOWN PROPERTY: WordProperty CombatGame.CombatTypes.MessengerInfo.RoomNumber
	int                                                RefModeGroupID;                                   		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                RefModeID;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                RefMapID;                                         		// 0x003C (0x0004) [0x0000000000000000]              
	unsigned long                                      bHasType : 1;                                     		// 0x0040 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHasSessionState : 1;                             		// 0x0040 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bHasAFK : 1;                                      		// 0x0040 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bHasNickname : 1;                                 		// 0x0040 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bHasLevel : 1;                                    		// 0x0040 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bHasLogoutTime : 1;                               		// 0x0040 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bHasLogoutDuration : 1;                           		// 0x0040 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bHasChannelID : 1;                                		// 0x0040 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bHasChannelNumber : 1;                            		// 0x0040 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bHasRoomNumber : 1;                               		// 0x0040 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bHasModeID : 1;                                   		// 0x0040 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bHasMapID : 1;                                    		// 0x0040 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bHasModeGroupID : 1;                              		// 0x0040 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bGrade : 1;                                       		// 0x0040 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bCallingCard : 1;                                 		// 0x0040 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bClanName : 1;                                    		// 0x0040 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      bClanTotalPoint : 1;                              		// 0x0040 (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      bTierPoint : 1;                                   		// 0x0040 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bCompetitionModeID : 1;                           		// 0x0040 (0x0004) [0x0000000000000000] [0x00040000] 
	int                                                ClanPoint;                                        		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                CallingCardID;                                    		// 0x0048 (0x0004) [0x0000000000000000]              
	struct FString                                     ClanName;                                         		// 0x004C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                ClanTotalPoint;                                   		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                RankPoint;                                        		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                TierPoint;                                        		// 0x0064 (0x0004) [0x0000000000000000]              
	int                                                CompetitionModeID;                                		// 0x0068 (0x0004) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x006C (0x0001) [0x0000000000000000]              
	unsigned char                                      GRADE;                                            		// 0x006D (0x0001) [0x0000000000000000]              
	struct FTimeData                                   RegistrationTime;                                 		// 0x0070 (0x0008) [0x0000000000000000]              
};

// ScriptStruct CombatGame.CombatTypes.BoosterItem
// 0x001C
struct FBoosterItem
{
	int                                                BoosterItemID;                                    		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UCombatDataTableRefBoosterItem*              DataTable;                                        		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FTimeData                                   ExpireTime;                                       		// 0x000C (0x0008) [0x0000000000100001]              ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x0014 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bIsActive : 1;                                    		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatTypes.ShopItemValueStruct
// 0x0094
struct FShopItemValueStruct
{
	int                                                RentalID;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ValueType;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                PriceType;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                Mainprice;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                AddPriceType;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                AddPrice[ 0x5 ];                                  		// 0x0014 (0x0014) [0x0000000000000000]              
	int                                                ValueRange[ 0x5 ];                                		// 0x0028 (0x0014) [0x0000000000000000]              
	int                                                ItemPrice[ 0x5 ];                                 		// 0x003C (0x0014) [0x0000000000000000]              
	int                                                SalePrice[ 0x5 ];                                 		// 0x0050 (0x0014) [0x0000000000000000]              
	struct FTimeData                                   SellSaleStart;                                    		// 0x0064 (0x0008) [0x0000000000000000]              
	struct FTimeData                                   SellSaleEnd;                                      		// 0x006C (0x0008) [0x0000000000000000]              
	struct FString                                     AddReplaceItem;                                   		// 0x0074 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     MailFormCodename;                                 		// 0x0084 (0x0010) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.ExplosionDamageAdjustment
// 0x0008
struct FExplosionDamageAdjustment
{
	unsigned char                                      BodyType;                                         		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              DamageRatio;                                      		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct CombatGame.CombatTypes.DialogLocalizingData
// 0x0068
struct FDialogLocalizingData
{
	int                                                TitleId;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MessageId;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                InputID;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                OKBtnLabelID;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                CancelBtnLabelID;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                MaxChar;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FString                                     Title;                                            		// 0x0018 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Message;                                          		// 0x0028 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Input;                                            		// 0x0038 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     OKBtnLabel;                                       		// 0x0048 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CancelBtnLabel;                                   		// 0x0058 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.ChattingInfo
// 0x0024
struct FChattingInfo
{
	unsigned long                                      Id : 1;                                           		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     ChatColor;                                        		// 0x0004 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     msg;                                              		// 0x0014 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct CombatGame.CombatTypes.TacticalMapPlayerIconInfo
// 0x0008
struct FTacticalMapPlayerIconInfo
{
	unsigned long                                      bActivate : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bActivate_Spec : 1;                               		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bDisplayWhenNoRendering : 1;                      		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
